<a href="https://colab.research.google.com/github/etumi/ETL-Project/blob/master/ETL_notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
AA_url = 'https://raw.githubusercontent.com/etumi/ETL-Project/master/Resources/AA_database.csv'
df = pd.read_csv(AA_url)

In [3]:
df.head()

        Year  Ceremony    Award  Winner                 Name              Film
0  1927/1928         1    Actor     NaN  Richard Barthelmess         The Noose
1  1927/1928         1    Actor     1.0        Emil Jannings  The Last Command
2  1927/1928         1  Actress     NaN       Louise Dresser   A Ship Comes In
3  1927/1928         1  Actress     1.0         Janet Gaynor        7th Heaven
4  1927/1928         1  Actress     NaN       Gloria Swanson    Sadie Thompson

In [0]:
df2 = df.copy()

In [5]:
df2[['Year1','Year2']] = df2.Year.str.split("/",expand=True,)
df2.head()

        Year  Ceremony    Award  ...              Film Year1 Year2
0  1927/1928         1    Actor  ...         The Noose  1927  1928
1  1927/1928         1    Actor  ...  The Last Command  1927  1928
2  1927/1928         1  Actress  ...   A Ship Comes In  1927  1928
3  1927/1928         1  Actress  ...        7th Heaven  1927  1928
4  1927/1928         1  Actress  ...    Sadie Thompson  1927  1928

[5 rows x 8 columns]